Repository: suplyai/echo-air-ios
Catalog: EchoAir/Resources/Localizable.xcstrings
Source language: en
Languages: es, ja, zh

# home_intro_primary
source: Enter an air waybill or container number, or scan any device QR code — we'll automatically identify and connect all devices in the shipment.
es: Introduce un número de guía aérea o de contenedor, o escanea el código QR de cualquier dispositivo — identificaremos y conectaremos automáticamente todos los dispositivos del envío.
ja: 航空運送状番号またはコンテナ番号を入力するか、デバイスのQRコードをスキャンしてください — 出荷内のすべてのデバイスを自動的に識別して接続します。
zh: 输入空运提单号或集装箱号，或扫描任意设备二维码 — 我们将自动识别并连接货运中的所有设备。

# home_intro_positioning
source: Stand close to the cargo where the device is attached, at the container door, or beside the ULD or pallets.
es: Mantente cerca de la carga donde está colocado el dispositivo, en la puerta del contenedor, o junto al ULD o los palés.
ja: デバイスが取り付けられている貨物、コンテナのドア、またはULDやパレットの近くに立ってください。
zh: 请靠近设备所在的货物、集装箱门口，或ULD或托盘旁边。

# home_action_awb_title
source: Enter your air waybill number
es: Ingrese el número de su guía aérea
ja: 航空運送状番号を入力
zh: 输入航空运单号

# home_action_awb_subtitle
source: On the cargo paperwork or label
es: En la documentación o etiqueta del envío
ja: 貨物書類またはラベルに記載
zh: 在货物文件或标签上

# home_enter_container_number
source: Enter your container number
es: Ingrese su número de contenedor
ja: コンテナ番号を入力
zh: 输入集装箱号

# home_enter_container_number_help
source: From the paperwork or on the container itself
es: En la documentación o en el contenedor mismo
ja: 書類またはコンテナ本体に記載
zh: 在文件或集装箱本体上

# home_scan_qr_button
source: Scan QR code of device
es: Escanear código QR del dispositivo
ja: デバイスのQRコードをスキャン
zh: 扫描设备二维码

# home_footer_no_account
source: No account needed. Your data is only shared with parties on this shipment.
es: No se necesita cuenta. Sus datos solo se comparten con las partes de este envío.
ja: アカウント不要。データはこの貨物の関係者とのみ共有されます。
zh: 无需账户。您的数据仅与本次货运的相关方共享。

# home_hero_image_description
source: A warehouse operator standing in front of air cargo containers, holding a phone.
es: Un operador de almacén frente a contenedores de carga aérea, con un teléfono en la mano.
ja: 倉庫作業員が航空貨物コンテナの前でスマートフォンを持って立っています。
zh: 一名仓库操作员手持手机站在航空货运集装箱前。

# home_language_selector_label
source: Change language
es: Cambiar idioma
ja: 言語を変更
zh: 切换语言

# settings_title
source: Settings
es: Ajustes
ja: 設定
zh: 设置

# settings_language
source: Language
es: Idioma
ja: 言語
zh: 语言

# settings_debug_run_spike
source: Run kbeaconlib2 spike (debug)
es: Ejecutar spike kbeaconlib2 (debug)
ja: kbeaconlib2 スパイクを実行 (debug)
zh: 运行 kbeaconlib2 探针 (调试)

# language_picker_title
source: Language
es: Idioma
ja: 言語
zh: 语言

# language_first_launch_set_to
source: We've set your language to %1$@.
es: Hemos configurado el idioma en %1$@.
ja: 言語を %1$@ に設定しました。
zh: 已将语言设置为 %1$@。

# language_first_launch_question
source: Is this correct?
es: ¿Es correcto?
ja: この設定でよろしいですか?
zh: 是否正确?

# language_first_launch_yes
source: Yes, continue
es: Sí, continuar
ja: はい、続行
zh: 正确,继续

# language_first_launch_change
source: Change language
es: Cambiar idioma
ja: 言語を変更
zh: 更改语言

# capture_title_qr
source: Scan device QR
es: Escanear QR del dispositivo
ja: デバイス QR をスキャン
zh: 扫描设备二维码

# capture_permission_grant
source: Grant camera permission
es: Conceder permiso de cámara
ja: カメラ権限を許可
zh: 授予相机权限

# awb_title
source: Enter AWB
es: Ingresar AWB
ja: AWB を入力
zh: 输入运单号

# awb_heading
source: Enter the 11-digit air waybill number
es: Ingresa el número de guía aérea (AWB) de 11 dígitos
ja: 11 桁の航空運送状番号 (AWB) を入力してください
zh: 请输入 11 位航空运单号 (AWB)

# awb_subheading
source: 3-digit airline prefix, then 8-digit serial.
es: Prefijo de aerolínea de 3 dígitos, luego serial de 8 dígitos.
ja: 航空会社コード 3 桁、続けて連番 8 桁。
zh: 3 位航空公司前缀,然后是 8 位流水号。

# awb_unknown_prefix
source: Unknown airline prefix.
es: Prefijo de aerolínea desconocido.
ja: 不明な航空会社コードです。
zh: 未知的航空公司前缀。

# awb_check_digit_mismatch
source: Check digit doesn't match — double-check the last digit.
es: El dígito de control no coincide — revisa el último dígito.
ja: チェックディジットが一致しません — 最後の桁を確認してください。
zh: 校验位不匹配 — 请核对最后一位。

# awb_check_digit_mismatch_expected
source: Check digit doesn't match — double-check the last digit (expected %1$lld).
es: El dígito de control no coincide — revisa el último dígito (se esperaba %1$lld).
ja: チェックディジットが一致しません — 最後の桁を確認してください (正しい値: %1$lld)。
zh: 校验位不匹配 — 请核对最后一位 (应为 %1$lld)。

# awb_continue
source: Continue
es: Continuar
ja: 続行
zh: 继续

# awb_continue_loading
source: Looking up shipment…
es: Buscando envío…
ja: 貨物を検索中…
zh: 正在查找货运…

# container_entry_title
source: Enter container number
es: Ingresar contenedor
ja: コンテナ番号を入力
zh: 输入集装箱号

# container_entry_heading
source: Enter the 11-character container number
es: Ingresa el número de contenedor de 11 caracteres
ja: 11 文字のコンテナ番号を入力してください
zh: 请输入 11 位集装箱号

# container_entry_subheading
source: 4-letter owner code, 6-digit serial, 1-digit check.
es: Código de propietario de 4 letras, serie de 6 dígitos, dígito de control.
ja: 所有者コード 4 文字、シリアル 6 桁、チェックディジット 1 桁。
zh: 4 位所有者代码,6 位序列号,1 位校验码。

# container_entry_validation_format
source: Container numbers are 4 letters followed by 7 digits.
es: Los números de contenedor son 4 letras seguidas de 7 dígitos.
ja: コンテナ番号はアルファベット 4 文字と数字 7 桁です。
zh: 集装箱号为 4 个字母后跟 7 位数字。

# container_entry_validation_checkdigit
source: Check digit doesn't match — double-check the last digit.
es: El dígito de control no coincide — revisa el último dígito.
ja: チェックディジットが一致しません — 最後の桁を確認してください。
zh: 校验位不匹配 — 请核对最后一位。

# container_entry_validation_checkdigit_expected
source: Check digit doesn't match — double-check the last digit (expected %1$lld).
es: El dígito de control no coincide — revisa el último dígito (se esperaba %1$lld).
ja: チェックディジットが一致しません — 最後の桁を確認してください (正しい値: %1$lld)。
zh: 校验位不匹配 — 请核对最后一位 (应为 %1$lld)。

# confirm_heading_low_confidence
source: Double-check this is your shipment
es: Verifica que este sea tu envío
ja: この貨物で間違いないかご確認ください
zh: 请确认这是您的货运

# confirm_fallback_commodity
source: Shipment
es: Envío
ja: 貨物
zh: 货运

# confirm_label_air_waybill
source: Air Waybill
es: Guía Aérea (AWB)
ja: 航空運送状 (AWB)
zh: 航空运单 (AWB)

# confirm_label_container_number
source: Container Number
es: Número de contenedor
ja: コンテナ番号
zh: 集装箱号

# confirm_badge_air_freight
source: Air freight
es: Carga aérea
ja: 航空貨物
zh: 空运

# confirm_badge_ocean_reefer
source: Ocean reefer
es: Reefer marítimo
ja: 海上冷蔵
zh: 海运冷藏

# confirm_no_devices_expected
source: No devices expected
es: Sin dispositivos esperados
ja: 収集対象のデバイスはありません
zh: 无需收集设备

# confirm_devices_to_collect
source: %1$lld devices to collect
es: %1$lld dispositivos por recolectar
ja: 収集対象 %1$lld 台
zh: 需要收集 %1$lld 个设备

# confirm_start_scanning
source: Start scanning
es: Comenzar escaneo
ja: スキャン開始
zh: 开始扫描

# common_cancel
source: Cancel
es: Cancelar
ja: キャンセル
zh: 取消

# system_bluetooth_off_title
source: Bluetooth is off
es: El Bluetooth está desactivado
ja: Bluetoothがオフです
zh: 蓝牙已关闭

# system_bluetooth_off_body
source: Bluetooth is required to collect device data. Please enable it to continue.
es: Se requiere Bluetooth para recolectar datos de los dispositivos. Actívalo para continuar.
ja: デバイスデータの収集にはBluetoothが必要です。続行するには有効にしてください。
zh: 收集设备数据需要使用蓝牙。请启用蓝牙以继续。

# system_bluetooth_enable_action
source: Enable Bluetooth
es: Activar Bluetooth
ja: Bluetoothを有効にする
zh: 启用蓝牙

# system_location_off_title
source: Location services are off
es: Los servicios de ubicación están desactivados
ja: 位置情報サービスがオフです
zh: 位置服务已关闭

# system_location_off_body
source: Location services are required for Bluetooth scanning on Android. Please enable them to continue.
es: Los servicios de ubicación son necesarios para el escaneo Bluetooth en Android. Actívalos para continuar.
ja: AndroidのBluetoothスキャンには位置情報サービスが必要です。続行するには有効にしてください。
zh: Android 蓝牙扫描需要位置服务。请启用以继续。

# system_location_enable_action
source: Open Location Settings
es: Abrir ajustes de ubicación
ja: 位置情報の設定を開く
zh: 打开位置设置

# collection_title_fallback
source: Collecting
es: Recolectando
ja: 収集中
zh: 正在收集

# collection_header_collected
source: Collected
es: Recolectados
ja: 収集済み
zh: 已收集

# collection_header_of
source: of
es: de

# collection_state_searching
source: Searching
es: Buscando
ja: 検索中
zh: 正在搜索

# collection_state_in_range
source: In range
es: En rango
ja: 範囲内
zh: 在范围内

# collection_state_connecting
source: Connecting…
es: Conectando…
ja: 接続中…
zh: 连接中…

# collection_state_syncing
source: Syncing
es: Sincronizando
ja: 同期中
zh: 同步中

# collection_state_finalising
source: Finalising…
es: Finalizando…
ja: 最終処理中…
zh: 完成中…

# collection_state_collected
source: Collected
es: Recolectado
ja: 収集完了
zh: 已收集

# collection_state_missing
source: Not detected
es: No detectado
ja: 検出されません
zh: 未检测到

# collection_state_error
source: Connection failed
es: Conexión fallida
ja: 接続に失敗しました
zh: 连接失败

# collection_state_syncing_with_percent
source: Syncing %1$lld%%
es: Sincronizando %1$lld%%
ja: 同期中 %1$lld%%
zh: 同步中 %1$lld%%

# collection_row_retry
source: Retry
es: Reintentar
ja: 再試行
zh: 重试

# collection_row_device_id
source: Device %1$@
es: Dispositivo %1$@
ja: デバイス %1$@
zh: 设备 %1$@

# collection_alarm_on_device
source: Alarm on device
es: Alarma en el dispositivo
ja: デバイスでアラームが発生
zh: 设备已触发告警

# collection_hint_ambient
source: Hold your phone near the shipment.
es: Acerca tu teléfono al envío.
ja: スマートフォンを貨物に近づけてください。
zh: 请将手机靠近货运。

# collection_hint_get_closer
source: Move closer — devices are usually inside the ULD.
es: Acércate — los dispositivos suelen estar dentro del ULD.
ja: 近づいてください — デバイスは通常 ULD 内にあります。
zh: 请靠近 — 设备通常在 ULD 内部。

# collection_hint_check_device
source: Still searching. Check the device is inside the cargo and powered.
es: Aún buscando. Verifica que el dispositivo esté dentro de la carga y encendido.
ja: 検索中です。デバイスが貨物内にあり電源が入っていることをご確認ください。
zh: 仍在搜索。请确认设备位于货物内部并已上电。

# collection_hint_contact_shipper
source: Can't find this device. Contact your shipper if it may be missing.
es: No se encuentra este dispositivo. Contacta al remitente si crees que puede faltar.
ja: このデバイスが見つかりません。紛失の可能性がある場合は荷主にご連絡ください。
zh: 未找到此设备。如认为可能缺失，请联系发货方。

# collection_finish
source: All devices collected — finish
es: Todos los dispositivos recolectados — finalizar
ja: 全デバイスの収集完了 — 終了
zh: 所有设备已收集 — 完成

# collection_finding_devices
source: Finding devices…
es: Buscando dispositivos…
ja: デバイスを検索中…
zh: 正在查找设备…

# collection_collecting_label
source: Collecting…
es: Recolectando…
ja: 収集中…
zh: 正在收集…

# collection_collecting_n_of_m
source: %1$lld of %2$lld collected
es: %1$lld de %2$lld recolectados
ja: %2$lld 台中 %1$lld 台収集済み
zh: 已收集 %1$lld / %2$lld

# collection_close_partial
source: Close shipment without remaining devices
es: Cerrar envío sin los dispositivos restantes
ja: 残りのデバイスを含めずに貨物を終了
zh: 关闭货运并忽略剩余设备

# confirm_mps_badge
source: Multiple Package Shipment (MPS)
es: Envío de múltiples paquetes (MPS)
ja: 複数個口貨物 (MPS)
zh: 多包装件货运 (MPS)

# confirm_mps_summary
source: %1$lld units · %2$lld devices total
es: %1$lld unidades · %2$lld dispositivos en total
ja: %1$lld ユニット · 合計 %2$lld 台
zh: %1$lld 个单元 · 共 %2$lld 台设备

# collection_unit_progress
source: %1$lld of %2$lld collected
es: %1$lld de %2$lld recolectados
ja: %2$lld 台中 %1$lld 台収集済み
zh: 已收集 %1$lld / %2$lld

# collection_unattributed_unit
source: Unattributed
es: Sin atribuir
ja: 未割当
zh: 未归属

# collection_close_dialog_title_finish
source: Finish shipment?
es: ¿Finalizar envío?
ja: 貨物を終了しますか?
zh: 完成此次货运?

# collection_close_dialog_title_partial
source: Close without %1$lld devices?
es: ¿Cerrar sin %1$lld dispositivos?
ja: %1$lld 台未収集のまま終了しますか?
zh: 未收集 %1$lld 个设备就关闭?

# collection_close_dialog_body_partial
source: Missing devices will be recorded in the attestation pack.
es: Los dispositivos faltantes se registrarán en el paquete de atestación.
ja: 未収集のデバイスは証明書パックに記録されます。
zh: 未收集的设备将被记录在证明文件中。

# collection_close_dialog_body_all
source: All expected devices have been collected.
es: Se han recolectado todos los dispositivos esperados.
ja: 予定されていた全デバイスを収集しました。
zh: 所有预期设备均已收集完毕。

# collection_close_dialog_confirm
source: Close shipment
es: Cerrar envío
ja: 貨物を終了
zh: 关闭货运

# location_rationale_title
source: Attach location to each scan?
es: ¿Adjuntar ubicación a cada escaneo?
ja: 各スキャンに位置情報を付与しますか?
zh: 是否为每次扫描附加位置?

# location_rationale_body
source: Echo Air attaches the scan location to the shipment's audit trail, so the timeline shows where each device was scanned. Your location is only captured when you scan a device.
es: Echo Air adjunta la ubicación del escaneo al registro del envío, para que la línea de tiempo muestre dónde se escaneó cada dispositivo. Tu ubicación solo se captura cuando escaneas un dispositivo.
ja: Echo Air はスキャン位置を貨物の監査記録に付与し、各デバイスがどこでスキャンされたかをタイムラインに表示します。位置情報はデバイスをスキャンした瞬間のみ取得されます。
zh: Echo Air 会将扫描位置附加到货运的审计记录，以便时间线显示每台设备的扫描地点。仅在您扫描设备时捕获位置。

# location_rationale_accept
source: Allow
es: Permitir
ja: 許可
zh: 允许

# location_rationale_decline
source: Not now
es: Ahora no
ja: 後で
zh: 暂不

# failure_unreachable_title
source: Can't reach Suply servers
es: No se puede conectar con los servidores de Suply
ja: Suply サーバーに接続できません
zh: 无法连接到 Suply 服务器

# failure_unreachable_body
source: Check your internet connection, then try again.
es: Revisa tu conexión a internet e intenta nuevamente.
ja: インターネット接続を確認してから再試行してください。
zh: 请检查网络连接后重试。

# failure_timeout_title
source: Suply servers aren't responding
es: Los servidores de Suply no responden
ja: Suply サーバーが応答しません
zh: Suply 服务器未响应

# failure_timeout_body
source: This usually clears up after a few seconds. Try again.
es: Esto suele resolverse en pocos segundos. Intenta nuevamente.
ja: 通常は数秒で解消します。再試行してください。
zh: 通常几秒钟后即可恢复。请重试。

# failure_server_title
source: Something went wrong
es: Algo salió mal
ja: エラーが発生しました
zh: 出错了

# failure_server_body_with_code
source: Suply returned an error (HTTP %1$lld). Try again in a moment, or contact your shipper if it keeps happening.
es: Suply devolvió un error (HTTP %1$lld). Intenta nuevamente en un momento o contacta a tu embarcador si persiste.
ja: Suply がエラーを返しました (HTTP %1$lld)。しばらく経ってから再試行するか、解消しない場合は荷送人にご連絡ください。
zh: Suply 返回了错误 (HTTP %1$lld)。请稍后重试;如问题持续,请联系发货人。

# failure_server_body_unknown
source: Unexpected error. Try again in a moment.
es: Error inesperado. Intenta nuevamente en un momento.
ja: 予期しないエラーが発生しました。しばらく経ってから再試行してください。
zh: 发生未知错误。请稍后重试。

# failure_malformed_title
source: Unexpected response from Suply
es: Respuesta inesperada de Suply
ja: Suply から想定外のレスポンス
zh: Suply 返回了意外的响应

# failure_malformed_body
source: The server responded in a shape the app didn't recognise — usually means the backend was updated without the app catching up. Ask your shipper to check the deployment.
es: El servidor respondió con un formato que la app no reconoce — normalmente significa que el backend se actualizó sin que la app se actualizara también. Pide a tu embarcador que revise el despliegue.
ja: サーバーの応答形式をアプリが認識できません — 通常はバックエンドが更新されたがアプリが追従していないことを意味します。荷送人にデプロイの確認を依頼してください。
zh: 服务器返回的数据格式应用无法识别 — 通常意味着后端已更新但应用尚未同步。请联系发货人检查部署。

# failure_no_shipment_for_awb_title
source: No active shipment found
es: No se encontró un envío activo
ja: 進行中の貨物が見つかりません
zh: 未找到进行中的货运

# failure_no_shipment_for_awb_body
source: No active shipment was found for AWB %1$@. Double-check the number, or if the shipment has already been completed, contact your shipper.
es: No se encontró un envío activo para el AWB %1$@. Verifica el número; si el envío ya se completó, contacta a tu embarcador.
ja: AWB %1$@ に対応する進行中の貨物が見つかりません。番号を再確認してください。すでに完了している場合は荷送人にご連絡ください。
zh: 未找到对应 AWB %1$@ 的进行中货运。请核对运单号;如果货运已完成,请联系发货人。

# failure_no_shipment_for_container_title
source: No active shipment found
es: No se encontró un envío activo
ja: 進行中の貨物が見つかりません
zh: 未找到进行中的货运

# failure_no_shipment_for_container_body
source: No active shipment was found for container %1$@. Double-check the number, or if the shipment has already been completed, contact your shipper.
es: No se encontró un envío activo para el contenedor %1$@. Verifica el número; si el envío ya se completó, contacta a tu embarcador.
ja: コンテナ %1$@ に対応する進行中の貨物が見つかりません。番号を再確認してください。すでに完了している場合は荷送人にご連絡ください。
zh: 未找到对应集装箱 %1$@ 的进行中货运。请核对箱号;如果货运已完成,请联系发货人。

# failure_no_awb_in_image_title
source: Couldn't read the AWB
es: No se pudo leer el AWB
ja: AWB を読み取れませんでした
zh: 无法识别 AWB

# failure_no_awb_in_image_body
source: Try another angle or better lighting, or scan the device QR code instead.
es: Prueba con otro ángulo o mejor iluminación, o escanea el QR del dispositivo.
ja: 角度や照明を変えて再試行するか、デバイスの QR コードをスキャンしてください。
zh: 请换一个角度或改善光线,或改为扫描设备二维码。

# failure_device_not_registered_title
source: Device not registered
es: Dispositivo no registrado
ja: デバイスが未登録です
zh: 设备未注册

# failure_device_not_registered_body
source: This Echo Air device isn't registered in the system. Contact your shipper.
es: Este dispositivo Echo Air no está registrado en el sistema. Contacta a tu embarcador.
ja: この Echo Air デバイスはシステムに登録されていません。荷送人にご連絡ください。
zh: 此 Echo Air 设备未在系统中注册。请联系发货人。

# failure_device_not_assigned_title
source: Device not on an active shipment
es: Dispositivo sin envío activo
ja: デバイスが進行中の貨物に紐づいていません
zh: 设备未绑定到进行中的货运

# failure_device_not_assigned_body
source: This device is registered but isn't currently assigned to an active shipment. Contact your shipper.
es: Este dispositivo está registrado pero no está asignado a un envío activo. Contacta a tu embarcador.
ja: このデバイスは登録済みですが、現在進行中の貨物に紐づいていません。荷送人にご連絡ください。
zh: 此设备已注册,但当前未绑定到进行中的货运。请联系发货人。

# failure_unrecognised_qr_title
source: Unrecognised QR code
es: Código QR no reconocido
ja: 認識できない QR コード
zh: 无法识别的二维码

# failure_unrecognised_qr_body
source: Make sure you're scanning the QR label printed on an Echo Air device.
es: Asegúrate de estar escaneando la etiqueta QR impresa en un dispositivo Echo Air.
ja: Echo Air デバイスに印刷された QR ラベルをスキャンしていることを確認してください。
zh: 请确认您正在扫描 Echo Air 设备上印刷的二维码。

# permission_camera_rationale
source: Echo Air needs camera access to identify shipments from their documents.
es: Echo Air necesita acceso a la cámara para identificar envíos desde sus documentos.
ja: Echo Air は書類から貨物を識別するためにカメラへのアクセスを必要とします。
zh: Echo Air 需要相机权限以通过单据识别货运。

# permission_ble_rationale
source: Echo Air needs Bluetooth permission to collect data from shipment loggers.
es: Echo Air necesita permiso de Bluetooth para recolectar datos de los registradores del envío.
ja: Echo Air は貨物ロガーからデータを収集するために Bluetooth 権限を必要とします。
zh: Echo Air 需要蓝牙权限以从货运记录器中收集数据。

# permission_location_rationale
source: Android requires location permission before it will scan for Bluetooth devices. Some phone manufacturers (Honor, Huawei, Xiaomi) require this even on newer Android versions. Echo Air does not read or use your location itself.
es: Android requiere permiso de ubicación antes de escanear dispositivos Bluetooth. Algunos fabricantes (Honor, Huawei, Xiaomi) lo exigen incluso en versiones recientes de Android. Echo Air no lee ni utiliza tu ubicación.
ja: Android は Bluetooth デバイスをスキャンする前に位置情報の許可を要求します。一部メーカー (Honor、Huawei、Xiaomi) では新しい Android バージョンでもこれを要求します。Echo Air は位置情報自体を読み取ったり使用したりすることはありません。
zh: Android 在扫描蓝牙设备前需要位置权限。部分厂商 (荣耀、华为、小米) 即使在较新版本上也强制要求此权限。Echo Air 不会读取或使用您的位置。

# spike_title
source: kbeaconlib2 spike
es: Spike kbeaconlib2
ja: kbeaconlib2 スパイク
zh: kbeaconlib2 探针

# spike_field_mac_label
source: Device MAC (BC:57:29:1C:D6:A6)
es: MAC del dispositivo (BC:57:29:1C:D6:A6)
ja: デバイス MAC (BC:57:29:1C:D6:A6)
zh: 设备 MAC (BC:57:29:1C:D6:A6)

# spike_field_password_label
source: Password
es: Contraseña
ja: パスワード
zh: 密码

# spike_run
source: Run spike
es: Ejecutar spike
ja: スパイクを実行
zh: 运行探针

# spike_log_output
source: Log output
es: Registro
ja: ログ出力
zh: 日志输出

# common_ok
source: OK
zh: 确定
